run/raoNozzle_pe_waveTrans_setFields_all_farfield/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     myrhoCentralFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.005;

deltaT          1e-10;

writeControl    runTime;

writeInterval   1e-5;

//cycleWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   10;

adjustableRunTime yes;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.2;

maxDeltaT       1;

functions
{
    libs            ("libfieldFunctionObjects.so");

    Ma
    {
        type            MachNo;
        executeControl  writeTime;
        writeControl    writeTime;
    }

    fieldMinMax
    {
        // Mandatory entries (unmodifiable)
        type        fieldMinMax;
    
        // Mandatory entries (runtime modifiable)
        mode        magnitude;
        fields      (p T U);
    
        // Optional entries (runtime modifiable)
        location    true;
    
        // Optional (inherited) entries
        writePrecision  8;
        writeToFile     true;
        region          region0;
        enabled         true;
        log             true;
        timeStart       0;
        timeEnd         1000;
        executeControl  timeStep;
        executeInterval 1000;
        writeControl    timeStep;
        writeInterval   1000;
    }
}


// ************************************************************************* //
