run/raoNozzle_pe_waveTrans_setFields_all_farfield/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// What to extrude:
//      patch   : from patch of another case ('sourceCase')
//      mesh    : as above but with original case included
//      surface : from externally read surface

constructFrom patch;

sourceCase "../";
sourcePatches (wedge1);

// If construct from patch: patch to use for back (can be same as sourcePatch)
exposedPatchName wedge1;

// Flip surface normals before usage. Valid only for extrude from surface or
// patch.
flipNormals false;

extrudeModel        wedge;

nLayers             1;

expansionRatio      1.0;

sectorCoeffs
{
    axisPt      (0 0 0);
    axis        (-1 0 0);
    angle       1.25;  // For nLayers=1 assume symmetry so angle/2 on each side
}

// Do front and back need to be merged? Usually only makes sense for 360
// degree wedges.
mergeFaces false;

// Merge small edges. Fraction of bounding box.
mergeTol 0;


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
