run/raoNozzle_pe_waveTrans_setFields_all_farfield/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

#include "../constant/initialConditionsTemplate"

internalField   uniform (0 0 0);

boundaryField
{
    nozzleWall
    {
          type          noSlip;//slip;
    }
    "(farfieldInlet|farfieldOutlet|farfieldTop)"
    {
        type           waveTransmissive;
        gamma          $gamma;
    }
    inlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    "(wedge1|wedge2)"
    {
        type            wedge;
    }
}

// ************************************************************************* //
