run/raoNozzle_pe_waveTrans_setFields_all_farfield/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

#include "../constant/initialConditionsTemplate"

internalField   uniform $Ta;

boundaryField
{
    "(nozzleWall|farfieldInlet|farfieldOutlet|farfieldTop)"
    {
        type            zeroGradient;
    }
    inlet
    {
        type            totalTemperature;
        T0              uniform $T0;
        gamma           $gamma;
    }
    "(wedge1|wedge2)"
    {
        type            wedge;
    }
}

// ************************************************************************* //
