run/raoNozzle_pe_waveTrans_setFields_all_farfield/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
    name internalFaceSet;
    type faceSet;
    action new;
    source patchToFace;
    sourceInfo
    {
        name "defaultFaces";      // Name of patch or patch group,
                            // (regular expressions allowed)
    }
    }
//
//    {
//    name internalFacesZoneSet;    
//    type faceZoneSet;
//    action new;
//    source setToFaceZone;
//    sourceInfo
//    {
//        faceSet "internalFaceSet";       // name of faceSet
//    }
//    }
);

// ************************************************************************* //
